<?php

return [
    'errors'=>['errors_articles'=>'عفوا، هناك أخطاء!',
        'errors_photo'=>'الصورة ضرورية وبحجم لا يزيد عن 2M من نوع jpg|png',
        'errors_photo_max'=>'عفوا الصورة تجاوزت الحد المسموح به و هو 1 ميكابيت',
        'errors_title'=>'العنوان يجب أن يتراوح ما بين 3 و 255 حرف.',
        'errors_slug'=>'رابط المقال يجب ألا يتجاوز 255 حرف.',
        'errors_video'=>'رابط الفيديو يجب ألا يتجاوز 255 حرف.',
        'errors_body'=>'المرجو ادخال المحتوى.',
        'errors_str'=>'عفوا هناك خظا انت تحاول ادخال العنوان باللغة العربية مع العلم ان لغة الادخال ليست عربية',
        'errors_phone'=>'المرجو ادخال رقم الهاتف. بالصيغة الصحيحة',
        'errors_email'=>'قد أدخلت الايميل بصيغة خاطئة.',
        'errors_name'=>'يجب أن يتكون اسم المستخدم من حروف لاتينية و أرقام فقط.',
        'errors_pass'=>'ادخل كلمة المرور',
        'errors_user'=>'ادخل اسم المستخدم',
        'errors_is_email'=>'الايميل مستعمل من قبل',

        'errors_is_name'=>'الاسم مستعمل من قبل',

        'errors_is_phone'=>'رقم الهاتف مستعمل من قبل',],



    'articles'=>['article'=>'المقالات ',
        'article_all'=>'المقالات المترجمة للغات التلاث وحدها من تظهر هنا',
        /******************************************************************/
        'trs_ar'=>'هدا المقال تلزمه الترجمة الى اللغة العربية',
        'trs_fr'=>'هدا المقال تلزمه الترجمة الى اللغة الفرنسية',
        'trs_en'=>' هدا المقال تلزمه الترجمة الى اللغة الانجليزية',
        /**********************************************************************/
        'table_title'=>'العنوان',
        'table_author'=>'الكاتب',
        'table_date'=>'تاريخ الكتابة',
        'table_author_type'=>'نوع الكاتب',
        //  'table_title'=>'العنوان',

        /***************************************************************************/
        'add_articles'=>'اظافة مقال',
        'add_articles_ok'=>' اظافة المقال',
        'trans_articles'=>'ترجمة مقال',
        'title_article'=>'عنوان المقال',
        'slug_article'=>'رابط المقال يمكنك وضع العنوان شريطة ان يكتب بالفرنسية او الانجليزية في حالة كانت لغة الادخال عربية',
        'trans_article'=>'مقالات تلزمها الترجمة',
        'trans_activities'=>'انشطة تلزمها الترجمة',
        'trans_article_enter'=>'ادخل الترجمة',
        'trans_article_enter_ok'=>'حفظ الترجمة',
        'trans_lng'=>'المرجو اختيار لغة الترجمة',
        'save_lng'=>'المرجو اختيار لغة الادخال',
        'select_img'=>'المرجو ادخال الصورة',
        'select_img_ext'=>'المرجو تحديد صورة صالحة',
        'select_img_ext_type'=>' دات صيغة صحيحة png او jpg',
        'select_img_size'=>' الصورة كبيرة على الحد المسموح به',
        'trans_lng_ar'=>'العربية',
        'trans_lng_fr'=>'الفرنسية',
        'trans_lng_en'=>'الانجليزية',
        'trans_is_ok'=>'لقد تمت الترجمة بنجاح',
        'add_is_ok'=>'لقد تمت الاظافة بنجاح',
        'update_ok'=>'تعديل',
        'update_is_ok'=>'لقد تم التعديل بنجاح',
        'delete_is_ok'=>'لقد تم الحذف بنجاح',
        'delete_is_no'=>'عفوا لقد حدث خطا ما',
        'delete_it'=>'هل انت متاكد انك تريد الحذف',
        'delete_it_yes'=>'نعم',
        'delete_it_no'=>'لا',
        'activities'=>'الانشطة',
        'add_activities'=>'اظافة نشاط',
        'title_activities'=>'العنوان',
        'video_activities'=>'رابط الفيديو ... غير اجباري',
        'date_activities'=>'تاريخ النشاط',
        'store_activities'=>'لقد تمت اظافة النشاط بنجاح',
        'req_slug'=>'عفوا رابط المقال ضروري',],

    'videos'=>['videos'=>'الفيديوهات',
        'add_video'=>'اظف شريط فيديو',
        'cat_video'=>'المرجو تحديد صنف الشريط',
        'title_video'=>'المرجو كتابة عنوان الشريط',
        'linke_video'=>'المرجو ادخال رابط الشريط',
        'unique_video'=>'عفوا هدا الرابط مستخدم من قبل',
        'unique_title'=>'عفوا هدا العنوان مستخدم من قبل',
        'save_video'=>'حفظ الشريط',
        'is_ok_video'=>'لقد تمت اظافة الشريط',],
    'photos'=>['photos'=>'الصور','add_photo'=>'اظافة الصور',
        'is_ok_photo'=>'لقد تمت اظافة الصورة بنجاح'],

    'admins'=>['admins'=>'المستخدمين',
        'add_admin'=>'إضافة مستخدم جديد',
        'admins_lists'=>'تدبير المستخدمين',
        'admins_account'=>'بروفايل',
        'admins_account_edit'=>'تعديل البروفايل',
        'admins_account_name'=>'الاسم كاملا',
        'admins_account_email'=>'الإيميل',
        'admins_account_phone'=>'رقم الهاتف',
        'admins_account_pass'=>'كلمة المرور',
        'admins_account_passold'=>'كلمة المرور القديمة',
        'admins_account_passnew'=>'كلمة المرور الجديدة',
        'admins_account_passnew_conf'=>'تأكيد كلمة المرور الجديدة',
        'admins_is_created'=>'تمت اظافة المستخدم بنجاح',
    ],

    'about'=>['about'=>'عن الجمعية'],

    /***********************************************************************************************/
    'categories'=>['categories'=>'الاصناف',

        'add_category'=>'اظف صنفا',

    ],
    'settings'=>['settings'=>'اعدادت الموقع',

        'home_settings'=>'اعدادت الصفحة الرئيسية',
        'news_settings'=>'اعدادت صفحة الاخبار',
        'activities_settings'=>'اعدادت صفحة الانشظة',
        'picturs_settings'=>'اعدادت صفحة الصور',
        'videos_settings'=>'اعدادت صفحة الفيديوهات',

        'errors'=>['length'=>'الصورة تحنوي على أبعاد صورة غير صالحة'],
        'condition'=>['length'=>'المرجو احترام الابعاد التالية',

            'min_width'=>'1270','min_height'=>'565',

            'max_width'=>'1920','max_height'=>'640',

            'max_h'=>'طول الصورة لا يتجاوز',
            'min_h'=>'  طول الصورة لا يقل عن',

            'max_w'=>'وعرض الصورة لا يتجاوز',
            'min_w'=>' عرض الصورة لا يقل عن',

        ]

    ],

    'profiles'=>['profiles'=>'الحساب الشخصي',

        'profile_success'=>'تم تعديل البروفايل بنجاح',
        'avatar_success'=>'تم تعديل الصورة الشخصية بنجاح',
        'profile_error'=>'عفوا حدت خطأ ما',

        'password_setting'=>'تعديل كلمة المرور',
        'avatar_setting'=>'تعديل الصورة الشخصية',



        'enter_old_pass'=>'من فظلك ادخل كلمة المرور القديمة',
        'error_old_pass'=>' عفوا كلمة المرور القديمة غير صحيحة',

        'enter_new_pass'=>'من فظلك ادخل كلمة المرور الجديدة',
        'error_new_pass'=>'عفوا كلمة المرور غير متطابقة',
        'pass_is_pass'=>' عفوا انت لم تقم باي تغير فكلمة المرور التي ادخلت هي نفسها المسجلة الان'




    ],

    'permission'=>['permission'=>'عفوا فانت لاتملك الصلاحية للدخول الى هده الصفحة',

        'permission_admin'=>'هده الصفحة خاصة بالمدراء العامين',

        'permission_all'=>'حقوق الولوج',
        'permission_users'=>'المدراء وحقوق الولوج',
        'permission_select'=>'اختيار حقوق الولوج',

        'add_permission'=>'اظافة حق الولوج',

        'saved_permission'=>'تمت اظافة حق الولوج بنجاح',
        'not_saved_permission'=>'عفوا وقع خظا اثناء الاظافة'


    ],

    'home'=>['home'=>'الرئيسية'],
    'tables'=>['tables'=>'',

        't_username'=>'اسم المستخدم',

        't_email'=>'الايميل',

        't_avatar'=> 'الصورة الشخصية'
    ],

    'logins'=>['login_not_active'=>'عفوا الحساب الدي تريد الدخول به تم ايقافه من طرف الادارة'],

    'system'=>['system'=>'التحكم بالموقع',
        'system_on'


        ]

];